<a href="https://colab.research.google.com/github/rmontteiro/own_models/blob/main/bc_dataEngeener.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Importando bibliotecas

In [58]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

In [59]:
dados = pd.read_csv('/content/tested.csv')

In [60]:
dados.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         Q
1          893         1       3  ...   7.0000   NaN         S
2          894         0       2  ...   9.6875   NaN         Q
3          895         0       3  ...   8.6625   NaN         S
4          896         1       3  ...  12.2875   NaN         S

[5 rows x 12 columns]

In [61]:
dados_1 = dados.drop(['Name','Ticket','Cabin','Embarked'],axis=1)

In [62]:
dados_1.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0          892         0       3    male  34.5      0      0   7.8292
1          893         1       3  female  47.0      1      0   7.0000
2          894         0       2    male  62.0      0      0   9.6875
3          895         0       3    male  27.0      0      0   8.6625
4          896         1       3  female  22.0      1      1  12.2875

In [63]:
dados_1 = dados_1.set_index(['PassengerId'])

In [64]:
dados_1 = dados_1.rename(columns={'Survived':'target'},inplace=False)

In [65]:
dados_1.head()

             target  Pclass     Sex   Age  SibSp  Parch     Fare
PassengerId
892               0       3    male  34.5      0      0   7.8292
893               1       3  female  47.0      1      0   7.0000
894               0       2    male  62.0      0      0   9.6875
895               0       3    male  27.0      0      0   8.6625
896               1       3  female  22.0      1      1  12.2875

ESTATÍSTICA DESCRITIVA DOS DADOS

In [66]:
dados_1.describe()

           target      Pclass         Age       SibSp       Parch        Fare
count  418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean     0.363636    2.265550   30.272590    0.447368    0.392344   35.627188
std      0.481622    0.841838   14.181209    0.896760    0.981429   55.907576
min      0.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%      0.000000    1.000000   21.000000    0.000000    0.000000    7.895800
50%      0.000000    3.000000   27.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   39.000000    1.000000    0.000000   31.500000
max      1.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [67]:
dados_1.describe(include=['O'])

         Sex
count    418
unique     2
top     male
freq     266

TRANSFORMAÇÃO DOS DADOS

In [68]:
dados_1['Sex_f'] = np.where(dados_1['Sex']== 'female',1,0)

In [69]:
dados_1['PClass1'] = np.where(dados_1['Pclass']== '1',1,0)
dados_1['PClass2'] = np.where(dados_1['Pclass']== '2',1,0)
dados_1['PClass3'] = np.where(dados_1['Pclass']== '3',1,0)

In [70]:
dados_1 = dados_1.drop(['Sex','Pclass'],axis=1)

In [71]:
dados_1.head()

             target   Age  SibSp  Parch  ...  Sex_f  PClass1  PClass2  PClass3
PassengerId                              ...
892               0  34.5      0      0  ...      0        0        0        0
893               1  47.0      1      0  ...      1        0        0        0
894               0  62.0      0      0  ...      0        0        0        0
895               0  27.0      0      0  ...      0        0        0        0
896               1  22.0      1      1  ...      1        0        0        0

[5 rows x 9 columns]

In [72]:
dados_1.isnull().sum()

target      0
Age        86
SibSp       0
Parch       0
Fare        1
Sex_f       0
PClass1     0
PClass2     0
PClass3     0
dtype: int64

In [73]:
dados_1.fillna(0, inplace=True)

In [74]:
dados_1.isnull().sum()

target     0
Age        0
SibSp      0
Parch      0
Fare       0
Sex_f      0
PClass1    0
PClass2    0
PClass3    0
dtype: int64

AMOSTRAGEM

In [75]:
x_train, x_test, y_train, y_test = train_test_split(dados_1.drop(['target'], axis=1),
                                                    dados_1['target'],
                                                    test_size = 0.3,
                                                    random_state = 1234)
[{'treino':x_train.shape},{'teste':x_test.shape}]

[{'treino': (292, 8)}, {'teste': (126, 8)}]

MODELO

In [76]:
rndfortest = RandomForestClassifier(n_estimators= 1000,
                                    criterion='gini',
                                    max_depth=5)
rndfortest.fit(x_train,y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=5, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [77]:
probabilidade = rndfortest.predict_proba(dados_1.drop('target', axis = 1))[:,1]

In [78]:
classificacao = rndfortest.predict(dados_1.drop('target', axis = 1))

In [79]:
dados_1['probabilidade'] = probabilidade
dados_1['classificacao'] = classificacao

In [80]:
dados_1.head()

             target   Age  SibSp  ...  PClass3  probabilidade  classificacao
PassengerId                       ...
892               0  34.5      0  ...        0       0.029479              0
893               1  47.0      1  ...        0       0.928442              1
894               0  62.0      0  ...        0       0.045925              0
895               0  27.0      0  ...        0       0.022398              0
896               1  22.0      1  ...        0       0.925389              1

[5 rows x 11 columns]